Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz8110ca80176.h
#define PIN_PC22E_EBI_NCS2                         _UINT32_(86)
#define MUX_PC22E_EBI_NCS2                         _UINT32_(4) 
#define PINMUX_PC22E_EBI_NCS2                      ((PIN_PC22E_EBI_NCS2 << 16) | MUX_PC22E_EBI_NCS2)
#define PORT_PC22E_EBI_NCS2                        (_UINT32_(1) << 22)

#define PIN_PC21E_EBI_NCS3                         _UINT32_(85)
#define MUX_PC21E_EBI_NCS3                         _UINT32_(4) 
#define PINMUX_PC21E_EBI_NCS3                      ((PIN_PC21E_EBI_NCS3 << 16) | MUX_PC21E_EBI_NCS3)
#define PORT_PC21E_EBI_NCS3                        (_UINT32_(1) << 21)

#define PIN_PC05E_EBI_NRD                          _UINT32_(69)
#define MUX_PC05E_EBI_NRD                          _UINT32_(4) 
#define PINMUX_PC05E_EBI_NRD                       ((PIN_PC05E_EBI_NRD << 16) | MUX_PC05E_EBI_NRD)
#define PORT_PC05E_EBI_NRD                         (_UINT32_(1) << 5)

#define PIN_PD08E_EBI_NWAIT                        _UINT32_(104)
#define MUX_PD08E_EBI_NWAIT                        _UINT32_(4) 
#define PINMUX_PD08E_EBI_NWAIT                     ((PIN_PD08E_EBI_NWAIT << 16) | MUX_PD08E_EBI_NWAIT)
#define PORT_PD08E_EBI_NWAIT                       (_UINT32_(1) << 8)

#define PIN_PC04E_EBI_NWE_NWR0                     _UINT32_(68)
#define MUX_PC04E_EBI_NWE_NWR0                     _UINT32_(4) 
#define PINMUX_PC04E_EBI_NWE_NWR0                  ((PIN_PC04E_EBI_NWE_NWR0 << 16) | MUX_PC04E_EBI_NWE_NWR0)
#define PORT_PC04E_EBI_NWE_NWR0                    (_UINT32_(1) << 4)

/* ========== PORT definition for EIC peripheral ========== */
#define PIN_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PA16A_EIC_EXTINT0                      _UINT32_(16)
#define MUX_PA16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA16A_EIC_EXTINT0                   ((PIN_PA16A_EIC_EXTINT0 << 16) | MUX_PA16A_EIC_EXTINT0)
#define PORT_PA16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PA16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA16 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PB16A_EIC_EXTINT0                      _UINT32_(48)
#define MUX_PB16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB16A_EIC_EXTINT0                   ((PIN_PB16A_EIC_EXTINT0 << 16) | MUX_PB16A_EIC_EXTINT0)
#define PORT_PB16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PB16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB16 External Interrupt Line */

#define PIN_PC00A_EIC_EXTINT0                      _UINT32_(64)
#define MUX_PC00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC00A_EIC_EXTINT0                   ((PIN_PC00A_EIC_EXTINT0 << 16) | MUX_PC00A_EIC_EXTINT0)
#define PORT_PC00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PC00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC00 External Interrupt Line */

#define PIN_PD00A_EIC_EXTINT0                      _UINT32_(96)
#define MUX_PD00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD00A_EIC_EXTINT0                   ((PIN_PD00A_EIC_EXTINT0 << 16) | MUX_PD00A_EIC_EXTINT0)
#define PORT_PD00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PD00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD00 External Interrupt Line */

#define PIN_PD15A_EIC_EXTINT0                      _UINT32_(111)
#define MUX_PD15A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD15A_EIC_EXTINT0                   ((PIN_PD15A_EIC_EXTINT0 << 16) | MUX_PD15A_EIC_EXTINT0)
#define PORT_PD15A_EIC_EXTINT0                     (_UINT32_(1) << 15)
#define PIN_PD15A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD15 External Interrupt Line */

#define PIN_PE00A_EIC_EXTINT0                      _UINT32_(128)
#define MUX_PE00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PE00A_EIC_EXTINT0                   ((PIN_PE00A_EIC_EXTINT0 << 16) | MUX_PE00A_EIC_EXTINT0)
#define PORT_PE00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PE00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PE00 External Interrupt Line */

#define PIN_PG00A_EIC_EXTINT0                      _UINT32_(192)
#define MUX_PG00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PG00A_EIC_EXTINT0                   ((PIN_PG00A_EIC_EXTINT0 << 16) | MUX_PG00A_EIC_EXTINT0)
#define PORT_PG00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PG00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PG00 External Interrupt Line */

#define PIN_PA01A_EIC_EXTINT1                      _UINT32_(1) 
#define MUX_PA01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA01A_EIC_EXTINT1                   ((PIN_PA01A_EIC_EXTINT1 << 16) | MUX_PA01A_EIC_EXTINT1)
#define PORT_PA01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PA01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA01 External Interrupt Line */

#define PIN_PA17A_EIC_EXTINT1                      _UINT32_(17)
#define MUX_PA17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA17A_EIC_EXTINT1                   ((PIN_PA17A_EIC_EXTINT1 << 16) | MUX_PA17A_EIC_EXTINT1)
#define PORT_PA17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PA17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA17 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PB17A_EIC_EXTINT1                      _UINT32_(49)
#define MUX_PB17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB17A_EIC_EXTINT1                   ((PIN_PB17A_EIC_EXTINT1 << 16) | MUX_PB17A_EIC_EXTINT1)
#define PORT_PB17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PB17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB17 External Interrupt Line */

#define PIN_PC01A_EIC_EXTINT1                      _UINT32_(65)
#define MUX_PC01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC01A_EIC_EXTINT1                   ((PIN_PC01A_EIC_EXTINT1 << 16) | MUX_PC01A_EIC_EXTINT1)
#define PORT_PC01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PC01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC01 External Interrupt Line */

#define PIN_PC02A_EIC_EXTINT1                      _UINT32_(66)
#define MUX_PC02A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC02A_EIC_EXTINT1                   ((PIN_PC02A_EIC_EXTINT1 << 16) | MUX_PC02A_EIC_EXTINT1)
#define PORT_PC02A_EIC_EXTINT1                     (_UINT32_(1) << 2)
#define PIN_PC02A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC02 External Interrupt Line */

#define PIN_PC17A_EIC_EXTINT1                      _UINT32_(81)
#define MUX_PC17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC17A_EIC_EXTINT1                   ((PIN_PC17A_EIC_EXTINT1 << 16) | MUX_PC17A_EIC_EXTINT1)
#define PORT_PC17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PC17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC17 External Interrupt Line */

